org/simple-shell.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-05-15 Fri 22:46>
#+TITLE: Simple Shell

** 第一个 shell 脚本

#+BEGIN_SRC sh -n
  #!/bin/sh
  echo "Hello World!"
#+END_SRC

** 变量

#+BEGIN_SRC sh -n
  # 定义变量
  dec_var="declare variable"

  # 使用变量
  echo $dec_var                   # → declare variable
  echo ${dec_var}                 # → declare variable

  # 只读变量
  ro_var="readonly variable"
  readonly ro_var
  ro_var="re declare variable"    # → /bin/sh: Name: This variable is read only.

  # 删除变量
  del_var="delete variable"
  unset del_var
  echo $del_var                   # 没有任何输出
#+END_SRC

** 字符串

#+BEGIN_SRC sh -n
  u_name="Jack"
  echo "hello, ${u_name}!"        # → hello, Jack!

  # 单引号里的任何字符都会原样输出
  echo 'hello, ${u_name}!'        # → hello, ${u_name}!

  # 拼接字符串
  echo "hello, "$u_name"!"        # → hello, Jack!
  echo "hello, ${u_name}!"        # → hello, Jack!

  echo 'hello, '$u_name'!'        # → hello, Jack!
  echo 'hello, ${u_name}!'        # → hello, ${u_name}!

  # 获取字符串长度
  echo ${#u_name}                 # → 4

  # 提取子字符串
  echo ${u_name:1:3}              # → ack - 从 3 开始截取 3 个字符

  # 查找子字符串
  echo `expr index "$u_name" ck`  # → 2 - 字符 c 或 k 先出现的位置
#+END_SRC

** 数组

#+BEGIN_SRC sh -n
  # 定义数组
  # arr_name=(val1 val2 ... valN)
  arr_one_name=(0 1 2 3 4 5)

  arr_two_name[0]="val0"
  arr_two_name[1]="val1"
  arr_two_name[n]="valN"

  # 读取数组
  echo ${arr_two_name[n]}         # → valN
  # 使用 @ 或 * 符号获取数组中的所有元素
  echo ${arr_two_name[@]}         # → val0 val1 valN

  # 获取数组长度
  echo ${#arr_one_name[@]}        # → 6
  echo ${#arr_one_name[*]}        # → 6
#+END_SRC

** 注释

#+BEGIN_SRC sh -n
  # 这是一个单行注释
  # ---------------------------------
  # 多行注释

  :<<EOF
  注释内容...
  注释内容...
  注释内容...
  EOF

  # OR 其他符号

  :<<!
  注释内容...
  注释内容...
  注释内容...
  !
#+END_SRC

** 脚本传参

#+BEGIN_SRC sh -n
  # !/bin/sh
  # test.sh
  echo "执行的文件名： $0";
  echo "第一个参数为： $1";
  echo "第一个参数为： $2";
  echo "第一个参数为： $3";

  # 执行
  # chomod +x test.sh
  # ./test.sh 1 2 3
  # 结果如下 ↓↓↓
  # ---------------------------------
  # 执行的文件名： ./test.sh
  # 第一个参数为： 1
  # 第一个参数为： 2
  # 第一个参数为： 3
  # ---------------------------------
#+END_SRC

