public/simple-shell.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-14 Sun 15:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Simple Shell</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Simple Shell</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb03012e">第一个 shell 脚本</a></li>
<li><a href="#orge8d44d7">变量</a></li>
<li><a href="#org1a076ac">字符串</a></li>
<li><a href="#orgf7360af">数组</a></li>
<li><a href="#orgfd7f0e9">注释</a></li>
<li><a href="#org65918d8">脚本传参</a></li>
<li><a href="#orgf049f43">基本运算</a></li>
<li><a href="#orgf496e72">流程控制</a>
<ul>
<li><a href="#org37c1f0b">条件</a></li>
<li><a href="#org5904396">循环</a></li>
</ul>
</li>
<li><a href="#org28965e3">函数</a></li>
<li><a href="#org4182f6a">输入/输出重定向</a></li>
<li><a href="#orgc13d9c7">文件包含</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb03012e" class="outline-2">
<h2 id="orgb03012e">第一个 shell 脚本</h2>
<div class="outline-text-2" id="text-orgb03012e">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #75715E;">#</span><span style="color: #75715E;">!/bin/</span><span style="color: #F92672;">sh</span>
<span class="linenr">2: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"Hello World!"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8d44d7" class="outline-2">
<h2 id="orge8d44d7">变量</h2>
<div class="outline-text-2" id="text-orge8d44d7">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#23450;&#20041;&#21464;&#37327;</span>
<span class="linenr"> 2: </span><span style="color: #FD971F;">dec_var</span>=<span style="color: #E6DB74;">"declare variable"</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;&#21464;&#37327;</span>
<span class="linenr"> 5: </span><span style="color: #F92672;">echo</span> $<span style="color: #FD971F;">dec_var</span>                   <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; declare variable</span>
<span class="linenr"> 6: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">dec_var</span><span style="color: #AE81FF;">}</span>                 <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; declare variable</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#21482;&#35835;&#21464;&#37327;</span>
<span class="linenr"> 9: </span><span style="color: #FD971F;">ro_var</span>=<span style="color: #E6DB74;">"readonly variable"</span>
<span class="linenr">10: </span><span style="color: #F92672;">readonly</span> ro_var
<span class="linenr">11: </span><span style="color: #FD971F;">ro_var</span>=<span style="color: #E6DB74;">"re declare variable"</span>    <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; /bin/sh: Name: This variable is read only.</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;&#21464;&#37327;</span>
<span class="linenr">14: </span><span style="color: #FD971F;">del_var</span>=<span style="color: #E6DB74;">"delete variable"</span>
<span class="linenr">15: </span><span style="color: #F92672;">unset</span> del_var
<span class="linenr">16: </span><span style="color: #F92672;">echo</span> $<span style="color: #FD971F;">del_var</span>                   <span style="color: #75715E;"># </span><span style="color: #75715E;">&#27809;&#26377;&#20219;&#20309;&#36755;&#20986;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a076ac" class="outline-2">
<h2 id="org1a076ac">字符串</h2>
<div class="outline-text-2" id="text-org1a076ac">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #FD971F;">u_name</span>=<span style="color: #E6DB74;">"Jack"</span>
<span class="linenr"> 2: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"hello, ${u_name}!"</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; hello, Jack!</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#21333;&#24341;&#21495;&#37324;&#30340;&#20219;&#20309;&#23383;&#31526;&#37117;&#20250;&#21407;&#26679;&#36755;&#20986;</span>
<span class="linenr"> 5: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">'hello, ${u_name}!'</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; hello, ${u_name}!</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#25340;&#25509;&#23383;&#31526;&#20018;</span>
<span class="linenr"> 8: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"hello, "</span>$<span style="color: #FD971F;">u_name</span><span style="color: #E6DB74;">"!"</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; hello, Jack!</span>
<span class="linenr"> 9: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"hello, ${u_name}!"</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; hello, Jack!</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">'hello, '</span>$<span style="color: #FD971F;">u_name</span><span style="color: #E6DB74;">'!'</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; hello, Jack!</span>
<span class="linenr">12: </span><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">'hello, ${u_name}!'</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; hello, ${u_name}!</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#33719;&#21462;&#23383;&#31526;&#20018;&#38271;&#24230;</span>
<span class="linenr">15: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span>#<span style="color: #FD971F;">u_name</span><span style="color: #AE81FF;">}</span>                 <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; 4</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#25552;&#21462;&#23376;&#23383;&#31526;&#20018;</span>
<span class="linenr">18: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">u_name</span>:1:3<span style="color: #AE81FF;">}</span>              <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; ack - &#20174; 3 &#24320;&#22987;&#25130;&#21462; 3 &#20010;&#23383;&#31526;</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#25214;&#23376;&#23383;&#31526;&#20018;</span>
<span class="linenr">21: </span><span style="color: #F92672;">echo</span> <span style="color: #AE81FF; font-weight: bold;">`expr index "$u_name" ck`</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; 2 - &#23383;&#31526; c &#25110; k &#20808;&#20986;&#29616;&#30340;&#20301;&#32622;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7360af" class="outline-2">
<h2 id="orgf7360af">数组</h2>
<div class="outline-text-2" id="text-orgf7360af">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#23450;&#20041;&#25968;&#32452;</span>
<span class="linenr"> 2: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">arr_name=(val1 val2 ... valN)</span>
<span class="linenr"> 3: </span><span style="color: #FD971F;">arr_one_name</span>=<span style="color: #AE81FF;">(</span>0 1 2 3 4 5<span style="color: #AE81FF;">)</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>arr_two_name<span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>=<span style="color: #E6DB74;">"val0"</span>
<span class="linenr"> 6: </span>arr_two_name<span style="color: #AE81FF;">[</span>1<span style="color: #AE81FF;">]</span>=<span style="color: #E6DB74;">"val1"</span>
<span class="linenr"> 7: </span>arr_two_name<span style="color: #AE81FF;">[</span>n<span style="color: #AE81FF;">]</span>=<span style="color: #E6DB74;">"valN"</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#35835;&#21462;&#25968;&#32452;</span>
<span class="linenr">10: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">arr_two_name</span><span style="color: #66D9EF;">[</span>n<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>         <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; valN</span>
<span class="linenr">11: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992; @ &#25110; * &#31526;&#21495;&#33719;&#21462;&#25968;&#32452;&#20013;&#30340;&#25152;&#26377;&#20803;&#32032;</span>
<span class="linenr">12: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">arr_two_name</span><span style="color: #66D9EF;">[</span>@<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>         <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; val0 val1 valN</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #75715E;"># </span><span style="color: #75715E;">&#33719;&#21462;&#25968;&#32452;&#38271;&#24230;</span>
<span class="linenr">15: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span>#<span style="color: #FD971F;">arr_one_name</span><span style="color: #66D9EF;">[</span>@<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; 6</span>
<span class="linenr">16: </span><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span>#<span style="color: #FD971F;">arr_one_name</span><span style="color: #66D9EF;">[</span>*<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#8594; 6</span>
</pre>
</div>
</div>
</div>
